<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"71501174fa43d17e50b7ce4c28079d7d67b0828c08128ae8def3593a891234be","plan_job_ref":"Job Staging Image Build & Push #19 at https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7325026540","plan_hash":"4cd19a8800b1168bf7bf30359134342304ebfa99e8f00c5315f234934f3b1480","plan_text_format":"diff","version":"1.39.0"} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.fastapi-service will be updated in-place
!~  resource "aws_ecs_service" "fastapi-service" {
        id                                 = "arn:aws:ecs:eu-central-1:806066816337:service/fastapi-cluster/fastapi-service"
        name                               = "fastapi-service"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:eu-central-1:806066816337:task-definition/fastapi-docker-image:2" -> (known after apply)
#        (15 unchanged attributes hidden)

#        (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.service must be replaced
-/+ resource "aws_ecs_task_definition" "service" {
!~      arn                      = "arn:aws:ecs:eu-central-1:806066816337:task-definition/fastapi-docker-image:2" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:eu-central-1:806066816337:task-definition/fastapi-docker-image" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
-                   environment  = []
-                   mountPoints  = []
!~                  name         = "iis" -> "fastapi"
!~                  portMappings = [
+                       {
+                           containerPort = 5000
+                           hostPort      = 5000
                        },
                    ]
-                   volumesFrom  = []
#                    (4 unchanged attributes hidden)
                },
            ] # forces replacement
        )
!~      id                       = "********************" -> (known after apply)
!~      revision                 = 2 -> (known after apply)
-       tags                     = {} -> null
!~      tags_all                 = {} -> (known after apply)
#        (6 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Staging Image Build & Push #19](https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7325026540)